//-слэш - разрез /слэш в гору \слэш с горы
//Маркеры памяти
//void - пустота - космос - ничего - не использует память
//int  - интеджер - целое - память для чисел 12345
//char - символы - буквы
//long - для всего
//------setup - Название
//------() - круглые скобки (SHIFT+9, SHIFT+0) настройки
//------{} - фигурные скобки (SHIFT+Х, SHIFT+Ъ) Начало и конец
//Сложных приказов

// Спосоности:
// змейка: Вправо,Влево,Вперед,Назад.
void zVpered(){
  
}
void zVlevo(){
void zNazad() {
  void zVpravo(){


void provNagKnop 3(){
// проверить нажатие кнопки 1
void  knop1(){
// проверить нажатие кнопки 2
void   knop2(){
// проверить нажатие кнопки 3
void   knop3(){
// проверить нажатие кнопки 4
void   knop4(){
// показать пиксель
void pixel(){
// очистить матрица
void ochistmatri(){
// фрукт появиться
void frutspawn(){
// фрукт исчезнуть
void frutischez(){


void setup() {  


}

void loop() {
  
}
